Autodesk.Revit.DB.ExternalService.MultiServerService.SetActiveServers(System.Collections.Generic.IList{System.Guid},Autodesk.Revit.DB.Document)
Changes the active servers and/or their order for the given document.
Remarks:
More than one server per document can be set as active at any given time
in a multi-server service. A document does not have to have an explicitly
set active servers though - the application-wide active servers would be
normally used when the service is executed for such a document.
Having active servers for a document overrules the active servers
set for the application. That means if the service gets executed in
this particular document, the document-specific servers will be used
instead of the application-wide ones.
It is possible to set servers as active when other servers already are active
for that service in this document. Setting a new set or the same set
but with a different order will automatically replace the previously active
servers in that document
All the servers must be valid (registered with the service) and must be unique
in the set. The set may be empty though which allows to unset active servers
from a document, which means that the document will be executed with the currently
active servers set application-wide
serverIds:
A set of Ids of servers that are to be set as active for this service in this
document or an empty set if no server should currently be set as active in this
particular document.
document:
The document for which the servers are set as active.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some of the given Ids do not represent valid servers of the service.
-or-
The list of servers contains duplicates. The SetActiveServers method expects a set of unique servers.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation is not allowed because the service is being executed.
Since:
2013

Autodesk.Revit.DB.ExternalService.MultiServerService.SetActiveServers(System.Collections.Generic.IList{System.Guid})
Changes the active servers and/or their order.
Remarks:
More than one server can be active at any given time in a multi-server service,
but it is possible that no server is active (unless the service is mandatory).
An application-wide active servers get executed when the service is invoked
in the scope of the entire application (i.e. without a specific document),
or if the service is executed in a document but the document does not have
active servers explicitly set.
Setting active servers replaces previously active servers. Both the number
of servers and their orders is significant. Servers do always get executed
in the order in which they were set as active. If it is desired the order
of execution is different, the same set of active servers must be set again,
but in the modified, desired order.
serverIds:
A set of Ids of servers that are to be set as active for this service
or an empty set if no server should currently be set as active.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some of the given Ids do not represent valid servers of the service.
-or-
The list of servers contains duplicates. The SetActiveServers method expects a set of unique servers.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation is not allowed because the service is being executed.
Since:
2013

Autodesk.Revit.DB.ExternalService.MultiServerService.GetActiveServerIds(Autodesk.Revit.DB.Document)
Returns Ids of the servers currently applicable to the given document for the service.
Remarks:
The Ids would be of all the servers explicitly assigned to the specified document.
document:
The associated document.
Returns:
A set of GUIDs of the document-applicable active servers; the list may be empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ExternalService.MultiServerService.GetActiveServerIds
Returns Ids of the currently active application-level servers registered for the service.
Remarks:
More than one application-level server can be active at a given time in a multi-server service,
but it is possible that no server is active (unless the service is mandatory).
Returns:
A set of GUIDs of the application-wide active servers; the list may be empty.
Since:
2013

Autodesk.Revit.DB.ExternalService.MultiServerService.ExecutionPolicy
Specifies how a multi-server service executes servers during its execution.
Remarks:
Read descriptions for the items in the ExecutionPolicy enum
to find out details about all applicable execution policies.
Since:
2013

Autodesk.Revit.DB.ExternalService.MultiServerService
This class represents a multi-server service inside Revit application.
It is created when an instance of IMultiServerService is registered with Revit.
Since:
2013